Mr-Shannon/Library-Document/GD32/Libraries/GD32_USB_Library/Utilities/GD32_EVAL/GD3210C_EVAL/gd3210c_eval_lcd.h
/**
  ******************************************************************************
  * @file    GD3210cl_eval_lcd.h
  * @author  MCU SD
  * @version V1.0.0
  * @date    26-Dec-2014
  * @brief   This file contains all the functions prototypes for the lcd firmware driver.
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GD3210C_EVAL_LCD_H
#define __GD3210C_EVAL_LCD_H

#ifdef __cplusplus
    extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "gd3210c_eval.h"


/** @addtogroup Utilities
  * @{
  */

/** @addtogroup GD32_EVAL
  * @{
  */ 

/** @addtogroup GD3210C_EVAL
  * @{
  */
    
/** @addtogroup GD3210C_EVAL_LCD
  * @{
  */ 


/** @defgroup GD3210C_EVAL_LCD_Exported_Types
  * @{
  */
#define BANK1_LCD_C    ((uint32_t)0x60000000)    //LCD Reg  address
#define BANK1_LCD_D    ((uint32_t)0x61000000)    //LCD Data address

/**
  * @}
  */

/** @defgroup GD3210C_EVAL_LCD_Exported_Constants
  * @{
  */

/* LCD Registers */
#define R0                  0x00
#define R1                  0x01
#define R2                  0x02
#define R3                  0x03
#define R4                  0x04
#define R5                  0x05
#define R6                  0x06
#define R7                  0x07
#define R8                  0x08
#define R9                  0x09
#define R10                 0x0A
#define R11                 0x0B
#define R12                 0x0C
#define R13                 0x0D
#define R14                 0x0E
#define R15                 0x0F
#define R16                 0x10
#define R17                 0x11
#define R18                 0x12
#define R19                 0x13
#define R20                 0x14
#define R21                 0x15
#define R22                 0x16
#define R23                 0x17
#define R24                 0x18
#define R25                 0x19
#define R26                 0x1A
#define R27                 0x1B
#define R28                 0x1C
#define R29                 0x1D
#define R30                 0x1E
#define R31                 0x1F
#define R32                 0x20
#define R33                 0x21
#define R34                 0x22
#define R35                 0x23
#define R36                 0x24
#define R37                 0x25
#define R40                 0x28
#define R41                 0x29
#define R43                 0x2B
#define R45                 0x2D
#define R48                 0x30
#define R49                 0x31
#define R50                 0x32
#define R51                 0x33
#define R52                 0x34
#define R53                 0x35
#define R54                 0x36
#define R55                 0x37
#define R56                 0x38
#define R57                 0x39
#define R58                 0x3A
#define R59                 0x3B
#define R60                 0x3C
#define R61                 0x3D
#define R62                 0x3E
#define R63                 0x3F
#define R64                 0x40
#define R65                 0x41
#define R66                 0x42
#define R67                 0x43
#define R68                 0x44
#define R69                 0x45
#define R70                 0x46
#define R71                 0x47
#define R72                 0x48
#define R73                 0x49
#define R74                 0x4A
#define R75                 0x4B
#define R76                 0x4C
#define R77                 0x4D
#define R78                 0x4E
#define R79                 0x4F
#define R80                 0x50
#define R81                 0x51
#define R82                 0x52
#define R83                 0x53
#define R96                 0x60
#define R97                 0x61
#define R106                0x6A
#define R118                0x76
#define R128                0x80
#define R129                0x81
#define R130                0x82
#define R131                0x83
#define R132                0x84
#define R133                0x85
#define R134                0x86
#define R135                0x87
#define R136                0x88
#define R137                0x89
#define R139                0x8B
#define R140                0x8C
#define R141                0x8D
#define R143                0x8F
#define R144                0x90
#define R145                0x91
#define R146                0x92
#define R147                0x93
#define R148                0x94
#define R149                0x95
#define R150                0x96
#define R151                0x97
#define R152                0x98
#define R153                0x99
#define R154                0x9A
#define R157                0x9D
#define R192                0xC0
#define R193                0xC1
#define R229                0xE5

/* LCD color */
#define White               0xFFFF
#define Black               0x0000
#define Grey                0xF7DE
#define Blue                0x001F
#define Blue2               0x051F
#define Red                 0xF800
#define Magenta             0xF81F
#define Green               0x07E0
#define Cyan                0x7FFF
#define Yellow              0xFFE0

#define Line0               0
#define Line1               24
#define Line2               48
#define Line3               72
#define Line4               96
#define Line5               120
#define Line6               144
#define Line7               168
#define Line8               192
#define Line9               216

#define Horizontal          0x00
#define Vertical            0x01
#define HyalineBackColor    0x0001

/** @defgroup GD3210C_EVAL_LCD_Exported_Functions
  * @{
  */
void LCD_GPIO_Configuration (void);
void EXMC_LCD_Init          (void);

uint16_t LCD_ReadReg        (uint8_t LCD_Reg);
uint16_t LCD_BGR2RGB        (uint16_t Color);
uint16_t LCD_GetPoint       (uint16_t X, uint16_t Y);

void LCD_WriteReg           (uint16_t LCD_Reg, uint16_t LCD_RegValue);
void LCD_WriteCommand       (uint16_t LCD_RegValue);
void LCD_WriteRAM_Prepare   (void);
void LCD_WriteRAM           (uint16_t RGB_Code);
void LCD_Initializtion      (void);
void LCD_SetCursor          (uint16_t X, uint16_t Y);
void LCD_Clear              (uint16_t Color);

void LCD_SetPoint           (uint16_t X, 
                             uint16_t Y, 
                             uint16_t Point);

void LCD_SetWindows         (uint16_t StartX, 
                             uint16_t StartY, 
                             uint16_t EndX, 
                             uint16_t EndY);

void LCD_DrawHLine           (uint16_t X,
                              uint16_t StartY, 
                              uint16_t EndY, 
                              uint16_t Color, 
                              uint16_t Width);

void LCD_DrawPicture        (uint16_t StartX, 
                             uint16_t StartY, 
                             uint16_t EndX, 
                             uint16_t EndY, 
                             uint16_t *pic);

void LCD_PutChar            (uint16_t X, 
                             uint16_t Y, 
                             uint8_t  Char, 
                             uint16_t CharColor, 
                             uint16_t BackColor);

void LCD_PutChar_16x24      (uint16_t X, 
                             uint16_t Y, 
                             uint8_t  Char, 
                             uint16_t CharColor, 
                             uint16_t BackColor);

void LCD_SetRectangle       (uint16_t StartX, 
                             uint16_t StartY, 
                             uint16_t EndX, 
                             uint16_t EndY, 
                             uint16_t Point);

void LCD_SetRectangleColor  (uint16_t StartX, 
                             uint16_t StartY, 
                             uint16_t EndX, 
                             uint16_t EndY, 
                             uint16_t Point);

void GD3210CL_LCD_Init      (void);

#ifdef __cplusplus
}
#endif

#endif /* __GD3210C_EVAL_LCD_H */
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */ 
     
/************************ (C) COPYRIGHT 2014 GIGADEVICE *****END OF FILE****/
